// Напишите программу, которая будеть выдавать название дня
// недели по заданному номеру: 3 -> среда, 5 -> пятница 

int number = int.Parse(Console.ReadLine()!);

if (number == 1)
{
    Console.WriteLine("Monday");
}
if (number == 2)
{
    Console.WriteLine("Tuesday");
}
if (number == 3)
{
    Console.WriteLine("Wensday");
}
if (number == 4)
{
    Console.WriteLine("Thuesday");
}
if (number == 5)
{
    Console.WriteLine("Friday");
}
if (number == 6)
{
    Console.WriteLine("Satuday");
}
if (number == 7)
{
    Console.WriteLine("Sunday");
}